cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC2</name>
			<description>ADC2 Module</description>
			<baseAddress>0x4801C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x2000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ADC2_Tmr3_Int</name>
				<description>Interrupt node 2: ADC2, Timer3, BEMF, ADC3/4</description>
				<value>2</value>
			</interrupt>
			<registers>
				<register>
					<name>CAL_CH0_1</name>
					<description>Calibration for Channel 0 and 1</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GAIN_CH1</name>
							<description>Gain Calibration for channel 1</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH1</name>
							<description>Offset Calibration for channel 1</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAIN_CH0</name>
							<description>Gain Calibration for channel 0</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH0</name>
							<description>Offset Calibration for channel 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH2_3</name>
					<description>Calibration for Channel 2 and 3</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GAIN_CH3</name>
							<description>Gain Calibration for channel 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH3</name>
							<description>Offset Calibration for channel 3</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAIN_CH2</name>
							<description>Gain Calibration for channel 2</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH2</name>
							<description>Offset Calibration for channel 2</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH4_5</name>
					<description>Calibration for Channel 4 and 5</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GAIN_CH5</name>
							<description>Gain Calibration for channel 5</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH5</name>
							<description>Offset Calibration for channel 5</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>GAIN_CH4</name>
							<description>Gain Calibration for channel 4</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OFFS_CH4</name>
							<description>Offset Calibration for channel 4</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH6_7</name>
					<description>Calibration for Channel 6 and 7</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GAIN_CH7</name>
							<description>Gain Calibration for channel 7</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OFFS_CH7</name>
							<description>Offset Calibration for channel 7</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GAIN_CH6</name>
							<description>Gain Calibration for channel 6</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OFFS_CH6</name>
							<description>Offset Calibration for channel 6</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CAL_CH8_9</name>
					<description>Calibration for Channel 8 and 9</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>GAIN_CH9</name>
							<description>Gain Calibration for channel 9</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OFFS_CH9</name>
							<description>Offset Calibration for channel 9</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>GAIN_CH8</name>
							<description>Gain Calibration for channel 8</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>OFFS_CH8</name>
							<description>Offset Calibration for channel 8</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_EIM</name>
					<description>Channel Settings Bits for Exceptional Interrupt Measurement</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SEL</name>
							<description>Exceptional interrupt measurement (EIM) Trigger Trigger select</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCU6_SEL</name>
									<description>ccu6_int triggers EIM</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CP_SEL</name>
									<description>cp_clk triggers EIM</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>Exceptional interrupt measurement (EIM) Trigger Event enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>start of EIM disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>start of IEM enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REP</name>
							<description>Repeat count for exceptional interrupt measurement (EIM)</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>1</name>
									<description>Measurements</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2</name>
									<description>Measurements</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>4</name>
									<description>Measurements</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>8</name>
									<description>Measurements</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>16</name>
									<description>Measurements</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>32</name>
									<description>Measurements</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>64</name>
									<description>Measurements</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>128</name>
									<description>Measurements</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHx</name>
							<description>Channel set for exceptional interrupt measurement (EIM)</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b11101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b11110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHx_ESM</name>
					<description>Channel Settings Bits for Exceptional Sequence Measurement</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STS</name>
							<description>Exceptional Sequence Measurement is finished</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>not_active</name>
									<description>Exceptional Sequence Measurement not done</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>done</name>
									<description>Exceptional Sequence Measurement done</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>Enable for Exceptional Sequence Measurement Trigger Event</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>start of ESM disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>start of ESM enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SEL</name>
							<description>Exceptional Sequence Measurement Trigger Select</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCU6_SEL</name>
									<description>ccu6_int starts ESM</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CP_SEL</name>
									<description>cp_clk starts ESM</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_1</name>
							<description>Channel Sequence for Exceptional Sequence Measurement (ESM)</description>
							<lsb>6</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH6_EN</name>
									<description>Channel 6 enable</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH7_EN</name>
									<description>Channel 7 enable</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH8_EN</name>
									<description>Channel 8 enable</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH9_EN</name>
									<description>Channel 9 enable</description>
									<value>0b1000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ESM_0</name>
							<description>Channel Sequence for Exceptional Sequence Measurement (ESM)</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CH0_EN</name>
									<description>Channel 0 enable</description>
									<value>0b000001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH1_EN</name>
									<description>Channel 1 enable</description>
									<value>0b000010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH2_EN</name>
									<description>Channel 2 enable</description>
									<value>0b000100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH3_EN</name>
									<description>Channel 3 enable</description>
									<value>0b001000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH4_EN</name>
									<description>Channel 4 enable</description>
									<value>0b010000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CH5_EN</name>
									<description>Channel 5 enable</description>
									<value>0b100000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
