cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ADC34</name>
			<description>ADC34</description>
			<baseAddress>0x40008000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL_STS</name>
					<description>ADC3 and ADC4 Control and Status</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x04800000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC4_OSR</name>
							<description>ADC4 Oversampling Ratio</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>128</name>
									<description>Factor 128</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>256</name>
									<description>Factor 256</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>512</name>
									<description>Factor 512</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1024</name>
									<description>Factor 1024</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2048</name>
									<description>Factor 2048</description>
									<value>0b1011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC34_DITHVAL</name>
							<description>ADC34 Dither Value</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>ADC34_DITHEN</name>
							<description>ADC34 Dithering Enable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>ADC34 Dithering</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>ADC34 Dithering</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC34_EoC_CNT</name>
							<description>ADC34 EoC counter</description>
							<lsb>21</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value0</name>
									<description>ADC IRQ with every EoC</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value1</name>
									<description>ADC IRQ with every 8th EoC</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>ADC IRQ with every 16th EoC</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>ADC IRQ with every 32nd EoC</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC4_EoC_STS</name>
							<description>ADC4 End of Conversion</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Conversion ongoing</name>
									<description>ADC4 conversion still in progress</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Conversion finished</name>
									<description>ADC4 conversion terminated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC4_SOC</name>
							<description>ADC4 conversion enable (set after enabling ADC to allow settling of the analog converter part)</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>ADC4 data processing</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>ADC4 data processing</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC4_OFS_MEAS_EN</name>
							<description>ADC4 Offset Measurement Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Offset Measurement</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Offset Measurement</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC4_EN</name>
							<description>ADC4 analog frontend Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>ADC4 analog frontend switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>ADC4 analog frontend switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_OSR</name>
							<description>ADC3 Oversampling Ratio</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>128</name>
									<description>Factor 128</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>256</name>
									<description>Factor 256</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>512</name>
									<description>Factor 512</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>1024</name>
									<description>Factor 1024</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>2048</name>
									<description>Factor 2048</description>
									<value>0b1011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC34_REF_SEL</name>
							<description>ADC34 reference voltage selection</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>VAREF</name>
									<description>use VAREF / VAGND as reference</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>VDD_EXT</name>
									<description>use VDD_EXT / GND as reference</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_EoC_STS</name>
							<description>ADC3 End of Conversion</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Conversion ongoing</name>
									<description>ADC3 conversion still in progress</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Conversion finished</name>
									<description>ADC3 conversion terminated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_SOC</name>
							<description>ADC3 conversion enable (set after enabling ADC to allow settling of the analog converter part)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>ADC3 data processing</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>ADC3 data processing</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_OFS_MEAS_EN</name>
							<description>ADC3 Offset Measurement Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Offset Measurement</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Offset Measurement</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_EN</name>
							<description>ADC3 analog frontend Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>ADC3 analog frontend switched off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>ADC3 analog frontend switched on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RESU</name>
					<description>ADC3_ADC4_RESU</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC4_RESU</name>
							<description>ADC4 Result Register</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>ADC3_RESU</name>
							<description>ADC3 Result Register</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
