cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>BDRV</name>
			<description>Bridge Driver</description>
			<baseAddress>0x40034000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>BDRV_CP_Int</name>
				<description>Interrupt node14: BDRV, Charge Pump</description>
				<value>14</value>
			</interrupt>
			<registers>
				<register>
					<name>CP_CLK_CTRL</name>
					<description>Charge Pump Clock Control Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x0000CA16</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CPCLK_EN</name>
							<description>Charge Pump Clock Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Charge Pump Clock is switched off and has value of 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Charge Pump Clock is running</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>F_CP</name>
							<description>MSB of CP_CLK divider</description>
							<lsb>13</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DITH_UPPER</name>
							<description>CP_CLK upper frequency boundary during dithering</description>
							<lsb>8</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DITH_LOWER</name>
							<description>CP_CLK lower frequency boundary during dithering</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CP_CTRL_STS</name>
					<description>Charge Pump Control and Status Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x00000004</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VTHVCP9V_TRIM</name>
							<description>Charge Pump Output Voltage 9V Trimming</description>
							<lsb>26</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Threshold0</name>
									<description>7.5 V</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold1</name>
									<description>8.0 V</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold2</name>
									<description>8.5 V</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold3</name>
									<description>9.0 V</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP9V_SET</name>
							<description>Charge Pump 9 V Output Voltage Set</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>14V_Set</name>
									<description>output voltage set to 14V</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>9V_Set</name>
									<description>output voltage set to 9V</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPLOPWRM_EN</name>
							<description>Charge Pump Low Power Mode Enable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Low_Power_Mode_Disable</name>
									<description>low power mode inactive</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Low_Power_Mode_Enable</name>
									<description>low power mode active</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_UPTH_STS</name>
							<description>Driver Supply MU High Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver_Supply_Voltage_ok</name>
									<description>no overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver_Supply_Voltage_too_high</name>
									<description>overvoltage on VSD Pin detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VSDUP_DIS</name>
							<description>Driver shutdown on VSD Upper Voltage</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Shutdown_Enable</name>
									<description>DRVx shutdown on VSD overvoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Shutdown_Disable</name>
									<description>DRVx shutdown on VSD overvoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOTH_STS</name>
							<description>Driver Supply MU Low Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Driver_Supply_Voltage_ok</name>
									<description>no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver_Supply_Voltage_too_low</name>
									<description>undervoltage on VSD Pin detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VSDLO_DIS</name>
							<description>Driver shutdown on VSD Lower Voltage</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Shutdown_Enable</name>
									<description>DRVx shutdown on VSD undervoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Shutdown_Disable</name>
									<description>DRVx shutdown on VSD undervoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_STS</name>
							<description>Charge Pump MU High Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no overvoltage detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_high</name>
									<description>Charge Pump Output Voltage too high, overvoltage on charge pump output detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VCPUP_DIS</name>
							<description>Driver shutdown on Charge Pump Upper Voltage</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Shutdown_Enable</name>
									<description>DRVx shutdown on Charge Pumpe overvoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Shutdown_Disable</name>
									<description>DRVx shutdown on Charge Pump overvoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH1_STS</name>
							<description>Charge Pump MU Low Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Charge Pump Output Voltage too low, undervoltage on chargepump output detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DRVx_VCPLO_DIS</name>
							<description>Driver Shutdown on Charge Pump Low Voltage</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Shutdown_Enable</name>
									<description>DRVx shutdown on Charge Pump undervoltage enable.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Driver_Disable</name>
									<description>DRVx shutdown on Charge Pump undervoltage disable.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH2</name>
							<description>Charge Pump Output Voltage Lower Threshold Detection Level</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Threshold0</name>
									<description>7.325_V</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold1</name>
									<description>7.654_V</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold2</name>
									<description>7.982_V</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold3</name>
									<description>8.309_V</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold4</name>
									<description>8.638_V</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold5</name>
									<description>8.966_V</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold6</name>
									<description>9.293_V</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Threshold7</name>
									<description>9.620_V</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOTH2_STS</name>
							<description>Charge Pump Low Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ok</name>
									<description>Charge Pump Output Voltage ok, no undervoltage detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>too_low</name>
									<description>Charge Pump Output Voltage too low, undervoltage on chargepump output detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_RDY_EN</name>
							<description>Bridge Driver on Charge Pump Ready Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Bridge Driver can be immediately enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Bridge Driver can only be enabled when Charge Pump is ready</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CP_EN</name>
							<description>Charge Pump Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Charge Pump, circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Charge Pump, circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
