cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>CTRL1</name>
					<description>H-Bridge Driver Control 1</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x01010101</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HS2_OC_DIS</name>
							<description>High Side Driver Overcurrent Shutdown Disable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable overcurrent shutdown of driver</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable overcurrent shutdown of driver</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OC_STS</name>
							<description>External High Side 2 FET Over-current Status</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Overcurrent</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overcurrent</name>
									<description>over-current occurred; switch is automatically shutdown; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_SUPERR_STS</name>
							<description>High Side Driver 2 Supply Error Status</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VDS_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_STS</name>
							<description>High Side Driver 2 Drain Source Monitoring Status in OFF-State</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_short_on_external_FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short_on_external_FET_detected</name>
									<description>short detected; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DCS_EN</name>
							<description>High Side Driver 2 Diagnosis Current Source Enable</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable current source</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable current source; short diagnosis can be performed by evaluating the LSx/HSx_DS_STS Flag</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_ON</name>
							<description>High Side Driver 2 On</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_PWM</name>
							<description>High Side Driver 2 PWM Enable</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_EN</name>
							<description>High Side Driver 2 Enable</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_DIS</name>
							<description>High Side Driver Overcurrent Shutdown Disable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable overcurrent shutdown of driver</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable overcurrent shutdown of driver</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_STS</name>
							<description>External High Side 1 FET Over-current Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Overcurrent</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overcurrent</name>
									<description>over-current occurred; switch is automatically shutdown; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_SUPERR_STS</name>
							<description>High Side Driver 1 Supply Error Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VDS_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_STS</name>
							<description>High Side Driver 1 Drain Source Monitoring Status in OFF-State</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_short_on_external_FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short_on_external_FET_detected</name>
									<description>short detected; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DCS_EN</name>
							<description>High Side Driver 1 Diagnosis Current Source Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable current source</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable current source; short diagnosis can be performed by evaluating the LSx/HSx_SD_STS Flag</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_ON</name>
							<description>High Side Driver 1 On</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_PWM</name>
							<description>High Side Driver 1 PWM Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_EN</name>
							<description>High Side Driver 1 Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_DIS</name>
							<description>Low Side Driver Overcurrent Shutdown Disable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable overcurrent shutdown of driver</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable overcurrent shutdown of driver</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_STS</name>
							<description>External Low Side 2 FET Over-current Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Overcurrent</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overcurrent</name>
									<description>over-current occurred; switch is automatically shutdown; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_SUPERR_STS</name>
							<description>Low Side Driver 2 Supply Error Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VDS_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_STS</name>
							<description>Low Side Driver 2 Drain Source Monitoring Status in OFF-State</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_short_on_external_FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short_on_external_FET_detected</name>
									<description>short detected; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DCS_EN</name>
							<description>Low Side Driver 2 Diagnosis Current Source Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable current source</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable current source; short diagnosis can be performed by evaluating the LSx/HSx_SD_STS Flag</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_ON</name>
							<description>Low Side Driver 2 On</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_PWM</name>
							<description>Low Side Driver 2 PWM Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_EN</name>
							<description>Low Side Driver 2 Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_DIS</name>
							<description>Low Side Driver 1 Overcurrent Shutdown Disable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable overcurrent shutdown of driver</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable overcurrent shutdown of driver</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_STS</name>
							<description>External Low Side 1 FET Over-current Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Overcurrent</name>
									<description>no over-current Condition occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overcurrent</name>
									<description>over-current occurred; switch is automatically shutdown; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_SUPERR_STS</name>
							<description>Low Side Driver 1 Supply Error Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NORMAL</name>
									<description>supply is in required range.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SUPPLY_ERROR</name>
									<description>detected; this flag is an OR of the VDS_x_STS and VCP_x_STS flags.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_STS</name>
							<description>Low Side Driver 1 Drain Source Monitoring Status in OFF-State</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_short_on_external_FET</name>
									<description>no short detected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>short_on_external_FET_detected</name>
									<description>short detected; write clear status.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DCS_EN</name>
							<description>Low Side Driver 1 Diagnosis Current Source Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disable current source</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enable current source; short diagnosis can be performed by evaluating the LSx/HSx_SD_STS Flag</description>
									<value>0x1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_ON</name>
							<description>Low Side Driver 1 On</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>OFF</name>
									<description>Driver off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ON</name>
									<description>Driver on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_PWM</name>
							<description>Low Side Driver 1 PWM Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables control by PWM input</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables control by PWM input</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_EN</name>
							<description>Low Side Driver 1 Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Driver circuit power off</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Driver circuit power on</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
