cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>CCU6</name>
			<description>Capture Compare Unit 6</description>
			<baseAddress>0x4000C000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>CCU6_SR0_Int</name>
				<description>Interrupt node 4: CCU6 node0</description>
				<value>4</value>
			</interrupt>
			<interrupt>
				<name>CCU6_SR1_Int</name>
				<description>Interrupt node 5: CCU6 node1</description>
				<value>5</value>
			</interrupt>
			<interrupt>
				<name>CCU6_SR2_Int</name>
				<description>Interrupt node 6: CCU6 node2</description>
				<value>6</value>
			</interrupt>
			<interrupt>
				<name>CCU6_SR3_Int</name>
				<description>Interrupt node 7: CCU6 node3</description>
				<value>7</value>
			</interrupt>
			<registers>
				<register>
					<name>CC60R</name>
					<description>Capture/Compare Register for Channel CC60</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel x Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC60SR</name>
					<description>Capture/Compare Shadow Register for Channel CC60</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel x Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC61R</name>
					<description>Capture/Compare Register for Channel CC61</description>
					<addressOffset>0x38</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel x Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC61SR</name>
					<description>Capture/Compare Shadow Register for Channel CC61</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel x Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC62R</name>
					<description>Capture/Compare Register for Channel CC62</description>
					<addressOffset>0x3C</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel x Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC62SR</name>
					<description>Capture/Compare Shadow Register for Channel CC62</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel x Capture/Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63R</name>
					<description>Capture/Compare Register for Channel CC63</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCV</name>
							<description>Channel CC63 Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CC63SR</name>
					<description>Capture/Compare Shadow Register for Channel CC63</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CCS</name>
							<description>Shadow Register for Channel CC63 Compare Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPMODIF</name>
					<description>Compare State Modification Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>MCC60S</name>
							<description>Capture/Compare Status Modification Bits (Set) (x = 0, 1, 2, 3)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC61S</name>
							<description>Capture/Compare Status Modification Bits (Set) (x = 0, 1, 2, 3)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC62S</name>
							<description>Capture/Compare Status Modification Bits (Set) (x = 0, 1, 2, 3)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC63S</name>
							<description>Capture/Compare Status Modification Bits (Set) (x = 0, 1, 2, 3)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC60R</name>
							<description>Capture/Compare Status Modification Bits (Reset) (x = 0, 1, 2, 3)</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC61R</name>
							<description>Capture/Compare Status Modification Bits (Reset) (x = 0, 1, 2, 3)</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC62R</name>
							<description>Capture/Compare Status Modification Bits (Reset) (x = 0, 1, 2, 3)</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>MCC63R</name>
							<description>Capture/Compare Status Modification Bits (Reset) (x = 0, 1, 2, 3)</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CMPSTAT</name>
					<description>Compare State Register</description>
					<addressOffset>0x80</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CC60ST</name>
							<description>Capture/Compare State Bits (x = 0, 1, 2, 3)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC61ST</name>
							<description>Capture/Compare State Bits (x = 0, 1, 2, 3)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC62ST</name>
							<description>Capture/Compare State Bits (x = 0, 1, 2, 3)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC63ST</name>
							<description>Capture/Compare State Bits (x = 0, 1, 2, 3)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>In compare mode, the timer count is less than the compare value. In capture mode, the selected edge has not yet been detected since the bit has been reset by software the last time.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>In compare mode, the counter value is greater than or equal to the compare value. In capture mode, the selected edge has been detected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPOS0</name>
							<description>Sampled Hall Pattern Bits (x = 0, 1, 2)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input CCPOSx has been sampled as 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input CCPOSx has been sampled as 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPOS1</name>
							<description>Sampled Hall Pattern Bits (x = 0, 1, 2)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input CCPOSx has been sampled as 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input CCPOSx has been sampled as 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCPOS2</name>
							<description>Sampled Hall Pattern Bits (x = 0, 1, 2)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input CCPOSx has been sampled as 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input CCPOSx has been sampled as 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC60PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC61PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CC62PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT60PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT61PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT62PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUT63PS</name>
							<description>Passive State Select for Compare Outputs</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The corresponding compare output drives passive level while CC6xST is 0.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The corresponding compare output drives passive level while CC6xST is 1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13IM</name>
							<description>T13 Inverted Modulation</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T13 output is not inverted.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>T13 output is inverted for further modulation.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
