cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>T12MSEL</name>
					<description>Capture/Compare T12 Mode Select Register</description>
					<addressOffset>0x40</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>MSEL60</name>
							<description>Capture/Compare Mode Selection</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compare outputs disabled, pins CC6n and COUT6n can be used for I/O. No capture action.</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Compare output on pin CC6n, pin COUT6n can be used for I/O. No capture action.</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Compare output on pin COUT6n, pin CC6n can be used for I/O. No capture action.</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Compare output on pins COUT6n and CC6n.</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Double-Register Capture modes, see .</description>
									<value>0b01XX</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Hall Sensor mode, see . In order to enable the hall edge detection, all three MSEL6x must be programmed to Hall Sensor mode.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Hysteresis-like mode, see .</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Multi-Input Capture modes, see .</description>
									<value>0b101X</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Multi-Input Capture modes, see .</description>
									<value>0b11XX</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL61</name>
							<description>Capture/Compare Mode Selection</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compare outputs disabled, pins CC6n and COUT6n can be used for I/O. No capture action.</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Compare output on pin CC6n, pin COUT6n can be used for I/O. No capture action.</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Compare output on pin COUT6n, pin CC6n can be used for I/O. No capture action.</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Compare output on pins COUT6n and CC6n.</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Double-Register Capture modes, see .</description>
									<value>0b01XX</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Hall Sensor mode, see . In order to enable the hall edge detection, all three MSEL6x must be programmed to Hall Sensor mode.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Hysteresis-like mode, see .</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Multi-Input Capture modes, see .</description>
									<value>0b101X</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Multi-Input Capture modes, see .</description>
									<value>0b11XX</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MSEL62</name>
							<description>Capture/Compare Mode Selection</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Compare outputs disabled, pins CC6n and COUT6n can be used for I/O. No capture action.</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Compare output on pin CC6n, pin COUT6n can be used for I/O. No capture action.</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Compare output on pin COUT6n, pin CC6n can be used for I/O. No capture action.</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Compare output on pins COUT6n and CC6n.</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Double-Register Capture modes, see .</description>
									<value>0b01XX</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Hall Sensor mode, see . In order to enable the hall edge detection, all three MSEL6x must be programmed to Hall Sensor mode.</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Hysteresis-like mode, see .</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Multi-Input Capture modes, see .</description>
									<value>0b101X</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>Multi-Input Capture modes, see .</description>
									<value>0b11XX</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HSYNC</name>
							<description>Hall Synchronization</description>
							<lsb>12</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Any edge at one of the inputs CCPOSx (x = 0, 1, 2) triggers the sampling.</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A T13 compare-match triggers the sampling.</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>A T13 period-match triggers the sampling.</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The Hall sampling triggered by hardware sources is switched off.</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>A T12 period-match (while counting up) triggers the sampling.</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>A T12 one-match (while counting down) triggers the sampling.</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>A T12 compare-match of channel 0 (while counting up) triggers the sampling.</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>A T12 compare-match of channel 0 (while counting down) triggers the sampling.</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBYP</name>
							<description>Delay Bypass</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The delay bypass is not active. The dead-time counter DTC0 is generating a delay after the source signal becomes active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The delay bypass is active. The dead-time counter DTC0 is not used by the sampling of the Hall pattern.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T12PR</name>
					<description>Timer T12 Period Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T12PV</name>
							<description>T12 Period Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13</name>
					<description>Timer T13 Counter Register</description>
					<addressOffset>0x7C</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T13CV</name>
							<description>Timer T13 Counter Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T13PR</name>
					<description>Timer T13 Period Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T13PV</name>
							<description>T13 Period Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TCTR0</name>
					<description>Timer Control Register 0</description>
					<addressOffset>0x30</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T12CLK</name>
							<description>Timer T12 Input Clock Select</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fT12 = fCCU</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fT12 = fCCU / 2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fT12 = fCCU / 4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fT12 = fCCU / 8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fT12 = fCCU / 16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fT12 = fCCU / 32</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>fT12 = fCCU / 64</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>fT12 = fCCU / 128</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12PRE</name>
							<description>Timer T12 Prescaler Bit</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The additional prescaler for T12 is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The additional prescaler for T12 is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T12R</name>
							<description>Timer T12 Run Bit</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T12 is stopped.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T12 is running.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STE12</name>
							<description>Timer T12 Shadow Transfer Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The shadow register transfer is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The shadow register transfer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CDIR</name>
							<description>Count Direction of Timer T12</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T12 counts up.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>T12 counts down.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CTM</name>
							<description>T12 Operating Mode</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Edge-aligned Mode: T12 always counts up and continues counting from zero after reaching the period value.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Center-aligned Mode: T12 counts down after detecting a period-match and counts up after detecting a one-match.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13CLK</name>
							<description>Timer T13 Input Clock Select</description>
							<lsb>8</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fT13 = fCCU</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fT13 = fCCU / 2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fT13 = fCCU / 4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fT13 = fCCU / 8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fT13 = fCCU / 16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fT13 = fCCU / 32</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>fT13 = fCCU / 64</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>fT13 = fCCU / 128</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13PRE</name>
							<description>Timer T13 Prescaler Bit</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The additional prescaler for T13 is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The additional prescaler for T13 is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T13R</name>
							<description>Timer T13 Run Bit</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T13 is stopped.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T13 is running.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>STE13</name>
							<description>Timer T13 Shadow Transfer Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The shadow register transfer is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The shadow register transfer is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
