cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>ICSR</name>
					<description>Interrupt Control State Register</description>
					<addressOffset>0xD04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>NMIPENDSET</name>
							<description>NMI PendSet</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>on writes, has no effect. On reads, NMI is active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>on writes, make the NMI exception active. On reads, NMI is active.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVSET</name>
							<description>PendSV set-pending bit</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>on writes, has no effect. On reads, PendSV is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>on writes, make PendSV exception pending. On reads, PendSV is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSVCLR</name>
							<description>PendSV clear-pending bit</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>remove pending status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTSET</name>
							<description>SysTick exception set-pending bit</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>on writes, has no effect. On reads, SysTick is not pending.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>on writes, make SysTick exception pending. On reads, SysTick is pending.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PENDSTCLR</name>
							<description>SysTick exception clear-pending bit</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>remove pending status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISRPREEMPT</name>
							<description>ISRPREEMPT</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>will not service</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>will service a pending exception</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISRPENDING</name>
							<description>Interrupt pending flag. Excludes NMI and Faults</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no external interrupt is pending</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>external interrupt is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTPENDING</name>
							<description>Pending ISR number field</description>
							<lsb>12</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no pending exceptions</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>RETTOBASE</name>
							<description>RETTOBASE</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>There is an active exception other than the exception shown by IPSR.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>There is no active exception other than any exception shown by IPSR.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VECTACTIVE</name>
							<description>Active ISR number field</description>
							<lsb>0</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Thread mode</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>ICT</name>
					<description>Interrupt Controller Type</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INTLINESNUM</name>
							<description>Interrupt Lines</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>0 to 32</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>33 to 64</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>65 to 95</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>97 to 128</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>129 to 160</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>161 to 192</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>193 to 224</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>225 to 256</description>
									<value>0b00111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MMFAR</name>
					<description>MemManage Fault Status Register</description>
					<addressOffset>0xD34</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>ADDRESS</name>
							<description>Data Address for an MPU Fault</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IABR0</name>
					<description>Active Bit Register Interrupt Active Flags</description>
					<addressOffset>0x300</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Int_BDRV</name>
							<description>Interrupt Active for Bridge Driver</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT1</name>
							<description>Interrupt Active for External Int 1</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_EXINT0</name>
							<description>Interrupt Active for External Int 0</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART2</name>
							<description>Interrupt Active for UART2</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_UART1</name>
							<description>Interrupt Active for UART1</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC2</name>
							<description>Interrupt Active for SSC2</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_SSC1</name>
							<description>Interrupt Active for SSC1</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR3</name>
							<description>Interrupt Active for CCU6 SR3</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR2</name>
							<description>Interrupt Active for CCU6 SR2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR1</name>
							<description>Interrupt Active for CCU6 SR1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_CCU6SR0</name>
							<description>Interrupt Active for CCU6 SR0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC1</name>
							<description>Interrupt Active for ADC1</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_ADC2</name>
							<description>Interrupt Active for MU, ADC2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT2</name>
							<description>Interrupt Active for GPT2</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Int_GPT1</name>
							<description>Interrupt Active for GPT1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>disables interrupt for read operation, no effect for write operation</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>enables interrupt for read and write operation</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
