cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>GPT12E</name>
			<description>General Purpose Timer 12E</description>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x4000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>GPT1_Int</name>
				<description>Interrupt node 0: GPT1 Block</description>
				<value>0</value>
			</interrupt>
			<interrupt>
				<name>GPT2_Int</name>
				<description>Interrupt node 1: GPT2 Block</description>
				<value>1</value>
			</interrupt>
			<registers>
				<register>
					<name>CAPREL</name>
					<description>Capture/Reload Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>CAPREL</name>
							<description>Current reload value or Captured value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>Module Identification Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x5804</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Identification Number</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PISEL</name>
					<description>Port Input Select Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>IST2IN</name>
							<description>Input Select for T2IN</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T2INA is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T2INB is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST2EUD</name>
							<description>Input Select for T2EUD</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T2EUDA is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T2EUDB is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST3IN</name>
							<description>Input Select for T3IN</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T3INA is selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T3INB is selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal T3INC is selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal T3IND is selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST3EUD</name>
							<description>Input Select for T3EUD</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T3EUDA is selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T3EUDB is selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal T3EUDC is selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal T3EUDD is selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST4IN</name>
							<description>Input Select for T4IN</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T4INA is selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T4INB is selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal T4INC is selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal T4IND is selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST4EUD</name>
							<description>Input Select for T4EUD</description>
							<lsb>8</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T4EUDA is selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T4EUDB is selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal T4EUDC is selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal T4EUDD is selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST5IN</name>
							<description>Input Select for T5IN</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T5INA is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T5INB is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST5EUD</name>
							<description>Input Select for T5EUD</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T5EUDA is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T5EUDB is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST6IN</name>
							<description>Input Select for T6IN</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T6INA is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T6INB is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IST6EUD</name>
							<description>Input Select for T6EUD</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal T6EUDA is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal T6EUDB is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ISCAPIN</name>
							<description>Input Select for CAPIN</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Signal CAPINA is selected</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Signal CAPINB is selected</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Signal CAPINC (Read trigger from T3) is selected</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Signal CAPIND (Read trigger from T2 or T3 or T4) is selected</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2</name>
					<description>Timer T2 Count Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T2</name>
							<description>Timer T2 Current Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T2CON</name>
					<description>Timer T2 Control Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T2I</name>
							<description>Timer T2 Input Parameter Selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T2M</name>
							<description>Timer T2 Mode Control (Basic Operating Mode)</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer Mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counter Mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Gated Timer Mode with gate active low</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Gated Timer Mode with gate active high</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Reload Mode</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Capture Mode</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Incremental Interface Mode (Rotation Detection Mode)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Incremental Interface Mode (Edge Detection Mode)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2R</name>
							<description>Timer T2 Run Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T2 stops</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T2 runs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2UD</name>
							<description>Timer T2 Up/Down Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T2 counts up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T2 counts down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2UDE</name>
							<description>Timer T2 External Up/Down Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Count direction is controlled by bit T2UD; input T2EUD is disconnected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Count direction is controlled by input T2EUD</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2RC</name>
							<description>Timer T2 Remote Control</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T2 is controlled by its own run bit T2R</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T2 is controlled by the run bit T3R of core timer T3, not by bit T2R</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2IRDIS</name>
							<description>Timer T2 Interrupt Disable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt generation for T2CHDIR and T2EDGE interrupts in Incremental Interface Mode is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt generation for T2CHDIR and T2EDGE interrupts in Incremental Interface Mode is disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2EDGE</name>
							<description>Timer T2 Edge Detection</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No count edge was detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A count edge was detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2CHDIR</name>
							<description>Timer T2 Count Direction Change</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No change in count direction was detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A change in count direction was detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2RDIR</name>
							<description>Timer T2 Rotation Direction</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T2 counts up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T2 counts down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T3</name>
					<description>Timer T3 Count Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T3</name>
							<description>Timer T3 Current Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
