cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>T3CON</name>
					<description>Timer T3 Control Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T3I</name>
							<description>Timer T3 Input Parameter Selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T3M</name>
							<description>Timer T3 Mode Control</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer Mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counter Mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Gated Timer Mode with gate active low</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Gated Timer Mode with gate active high</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Incremental Interface Mode (Rotation Detection Mode)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Incremental Interface Mode (Edge Detection Mode)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3R</name>
							<description>Timer T3 Run Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T3 stops</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T3 runs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3UD</name>
							<description>Timer T3 Up/Down Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T3 counts up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T3 counts down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3UDE</name>
							<description>Timer T3 External Up/Down Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Count direction is controlled by bit T3UD; input T3EUD is disconnected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Count direction is controlled by input T3EUD</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3OE</name>
							<description>Overflow/Underflow Output Enable</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Alternate Output Function Disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>State of T3 toggle latch is output on pin T3OUT</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3OTL</name>
							<description>Timer T3 Overflow Toggle Latch</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>output toggle latch reset</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>output toggle latch set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BPS1</name>
							<description>GPT1 Block Prescaler Control</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fGPT/8</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fGPT/4</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fGPT/32</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fGPT/16</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3EDGE</name>
							<description>Timer T3 Edge Detection Flag</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No count edge was detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A count edge was detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3CHDIR</name>
							<description>Timer T3 Count Direction Change Flag</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No change of count direction was detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A change of count direction was detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3RDIR</name>
							<description>Timer T3 Rotation Direction Flag</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T3 counts up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T3 counts down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T4</name>
					<description>Timer T4 Count Register</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T4</name>
							<description>Timer T4 Current Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T4CON</name>
					<description>Timer T4 Control Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T4I</name>
							<description>Timer T4 Input Parameter Selection</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>T4M</name>
							<description>Timer T4 Mode Control (Basic Operating Mode)</description>
							<lsb>3</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer Mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counter Mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Gated Timer Mode with gate active low</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Gated Timer Mode with gate active high</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Reload Mode</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Capture Mode</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Incremental Interface Mode (Rotation Detection Mode)</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Incremental Interface Mode (Edge Detection Mode)</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4R</name>
							<description>Timer T4 Run Bit</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T4 stops</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T4 runs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4UD</name>
							<description>Timer T4 Up/Down Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T4 counts up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T4 counts down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4UDE</name>
							<description>Timer T4 External Up/Down Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Count direction is controlled by bit T4UD; input T4EUD is disconnected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Count direction is controlled by input T4EUD</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4RC</name>
							<description>Timer T4 Remote Control</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T4 is controlled by its own run bit T4R</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T4 is controlled by the run bit T3R of core timer T3, but not by bit T4R</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLRT2EN</name>
							<description>Clear Timer T2 Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No effect of T4EUD on timer T2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A falling edge on T4EUD clears timer T2</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLRT3EN</name>
							<description>Clear Timer T3 Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No effect of T4IN on timer T3</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A falling edge on T4IN clears timer T3</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4IRDIS</name>
							<description>Timer T4 Interrupt Disable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt generation for T4CHDIR and T4EDGE interrupts in Incremental Interface Mode is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt generation for T4CHDIR and T4EDGE interrupts in Incremental Interface Mode is disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4EDGE</name>
							<description>Timer T4 Edge Detection</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No count edge was detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A count edge was detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4CHDIR</name>
							<description>Timer T4 Count Direction Change</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No change in count direction was detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A change in count direction was detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T4RDIR</name>
							<description>Timer T4 Rotation Direction</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer T4 counts up</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer T4 counts down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T5</name>
					<description>Timer 5 Count Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>32</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>T5</name>
							<description>Timer T5 Current Value</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
