cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>LIN</name>
			<description>Local Interconnect Network</description>
			<baseAddress>0x4801E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x8</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CTRL_STS</name>
					<description>LIN Transceiver Control and Status</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>#00000000000110000000001000000111</resetValue>
					<resetMask>#11111111111110000001101111111111</resetMask>
					<fields>
						<field>
							<name>M_SM_ERR_CLR</name>
							<description>LIN Transceiver Mode or Slope Mode Error Clear</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_action</name>
									<description>Status unchanged</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Status clear</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HV_MODE</name>
							<description>LIN Transceiver High Voltage Input - Output Mode</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>High Voltage Mode Entry is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>High Voltage Mode Entry is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE_FB</name>
							<description>Feedback Signals for LIN Transmitter Mode Settings</description>
							<lsb>16</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FB_SM3</name>
							<description>Feedback Signal 3 for Slope Mode Setting</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FB_SM2</name>
							<description>Feedback Signal 2 for Slope Mode Setting</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>FB_SM1</name>
							<description>Feedback Signal 1 for Slope Mode Setting</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SM</name>
							<description>LIN Transmitter Slope mode control</description>
							<lsb>11</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Normal_Slope_Mode</name>
									<description>for max. 20 kBaud</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Fast_Slope_Mode</name>
									<description>for max. 40 kBaud</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Low_Slope_Mode</name>
									<description>for max. 10.4 kBaud</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Flash_Mode</name>
									<description>for max. 150 kBaud</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RXD</name>
							<description>Output Signal of Receiver</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TXD</name>
							<description>LIN Transmitter switch on (only used when LIN_HV_MODE is set)</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Pull_Down_LIN_Line</name>
									<description>Transmitter is switched on</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull_Up_Resistor_is_active</name>
									<description>Transmitter is switched off</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TXD_TMOUT_STS</name>
							<description>LIN TXD time-out status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>NO_TIMEOUT</name>
									<description>no time-out occured</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMEOUT</name>
									<description>time-out occured</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OC_STS</name>
							<description>LIN Receiver Overcurrent Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Overcurrent</name>
									<description>overcurrent status occured</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overcurrent</name>
									<description>overcurrent status occured</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OT_STS</name>
							<description>LIN Receiver Overtemperature Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Overtemperature</name>
									<description>overtemperature occured</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>overtemperature occured</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M_SM_ERR</name>
							<description>LIN Transceiver Mode or Slope Mode Error</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_Mode_or_Slope_Mode_Error</name>
									<description>Status (see corresponding Feedback registers)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode_or_Slope_Mode_Error</name>
									<description>Status (see corresponding Feedback registers)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>LIN transceiver power mode control</description>
							<lsb>1</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LIN_Sleep_Mode</name>
									<description>LIN module switched to LIN Sleep Mode</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN_Receive_Only_Mode</name>
									<description>LIN module switched to LIN Receive Only Mode</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LIN_Normal_Mode</name>
									<description>LIN module switched to LIN Normal Mode</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
