cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>PMU</name>
			<description>Power Management Unit</description>
			<baseAddress>0x50004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CNF_CYC_WAKE</name>
					<description>Dead Time in Cyclic Wake Register</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<resetValue>#00110111</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>E01</name>
							<description>Exponent</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Exponent value is 0</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Exponent value is 1</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Exponent value is 2</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Exponent value is 3</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>M03</name>
							<description>Mantissa</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Mantissa value is 1</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Mntissa value is 16</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_PMU_SETTINGS</name>
					<description>PMU Settings Register</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>#00000100</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>EN_VDDEXT_OC_OFF_N</name>
							<description>Disabling VDDEXT Shutdown in Overload Condition</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Shutdown enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Shutdown disabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CYC_WAKE_EN</name>
							<description>Enabling Cyclic Wake</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Cyclic Wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Cyclic Wake enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_RST_TFB</name>
					<description>Reset Blind Time Register</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<resetValue>0x00000003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RST_TFB</name>
							<description>Reset Pin Blind Time Selection Bits</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>RST_TFB_0</name>
									<description>0,5 us typ.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_1</name>
									<description>1 us typ.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_2</name>
									<description>5 us typ.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RST_TFB_3</name>
									<description>31 us typ.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CNF_WAKE_FILTER</name>
					<description>PMU Wake-up Timing Register</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>CNF_MON_FT</name>
							<description>Wake-up Filter time for Monitoring Inputs</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>20_us</name>
									<description>20 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>40_us</name>
									<description>40 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNF_LIN_FT</name>
							<description>Wake-up Filter time for LIN WAKE</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>30_us</name>
									<description>30 us filter time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>50_us</name>
									<description>50 us filter time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA00</name>
					<description>General Purpose User DATA0</description>
					<addressOffset>0x0C0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA0</name>
							<description>DATA0 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA01</name>
					<description>General Purpose User DATA1</description>
					<addressOffset>0x0C4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA1</name>
							<description>DATA1 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA02</name>
					<description>General Purpose User DATA2</description>
					<addressOffset>0x0C8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA2</name>
							<description>DATA2 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA03</name>
					<description>General Purpose User DATA3</description>
					<addressOffset>0x0CC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA3</name>
							<description>DATA3 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA04</name>
					<description>General Purpose User DATA4</description>
					<addressOffset>0x0D0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA4</name>
							<description>DATA4 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA05</name>
					<description>General Purpose User DATA5</description>
					<addressOffset>0x0D4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA5</name>
							<description>DATA5 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA06</name>
					<description>General Purpose User DATA6</description>
					<addressOffset>0x0D8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA6</name>
							<description>DATA6 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA07</name>
					<description>General Purpose User DATA7</description>
					<addressOffset>0x0DC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA7</name>
							<description>DATA7 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA08</name>
					<description>General Purpose User DATA8</description>
					<addressOffset>0x0E0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA8</name>
							<description>DATA8 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA09</name>
					<description>General Purpose User DATA9</description>
					<addressOffset>0x0E4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA9</name>
							<description>DATA9 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA10</name>
					<description>General Purpose User DATA10</description>
					<addressOffset>0x0E8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA10</name>
							<description>DATA10 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>GPUDATA11</name>
					<description>General Purpose User DATA11</description>
					<addressOffset>0x0EC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DATA11</name>
							<description>DATA11 Storage Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>LIN_WAKE_EN</name>
					<description>LIN Wake Enable</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>LIN_EN</name>
							<description>Lin Wake enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Disable</name>
									<description>LIN Wake disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable</name>
									<description>LIN Wake enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MON_CNF</name>
					<description>Settings Monitor 1</description>
					<addressOffset>0x034</addressOffset>
					<size>32</size>
					<resetValue>#01000111</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>STS</name>
							<description>MON Status Input</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MON input has low status</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MON input has high status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PU</name>
							<description>Pull-Up Current Source for MON Input Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-up source disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up source enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PD</name>
							<description>Pull-Down Current Source for MON Input Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-down source disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-down source enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RISE</name>
							<description>MON Wake-up on Rising Edge Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FALL</name>
							<description>MON Wake-up on Falling Edge Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Wake-up disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EN</name>
							<description>MON Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>MON disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MON enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMU_RESET_STS1</name>
					<description>Reset Status Hard Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PMU_1V5DidPOR</name>
							<description>Power-On Reset Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Power-On reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Power-On reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_PIN</name>
							<description>PIN-Reset Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No PIN-Reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>PIN-Reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_ExtWDT</name>
							<description>External Watchdog (WDT1) Reset Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No External Watchdog reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>External Watchdog reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_ClkWDT</name>
							<description>Clock Watchdog (CLKWDT) Reset Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Clock Watchdog reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clock Watchdog reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_LPR</name>
							<description>Low Priority Resets (see PMU_RESET_STS2)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Low Priority-Reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Low Priority executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_SleepEX</name>
							<description>Flag which indicates a reset caused by Sleep-Exit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No reset caused by Sleep-Exit executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Reset caused by Sleep-Exit executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_FAIL</name>
							<description>Flag which indicates a reset caused by a System Fail reported in the corresponding Fail Register</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No reset caused by System Fail executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Reset caused by System Fail executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMU_RESET_STS2</name>
					<description>Reset Status Soft Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>LOCKUP</name>
							<description>Lockup-Reset Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Lockup-Reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Lockup-Reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_SOFT</name>
							<description>Soft-Reset Flag</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Soft-Reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Soft-Reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_IntWDT</name>
							<description>Internal Watchdog Reset Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Internal Watchdog reset executed</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Internal Watchdog reset executed</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
