cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>PMU_SUPPLY_STS</name>
					<description>Voltage Reg Status Register</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11001100</resetMask>
					<fields>
						<field>
							<name>PMU_5V_FAIL_EN</name>
							<description>Enabling of VDDP status information as interrupt source</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No interrupts are generated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupts are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVERLOAD</name>
							<description>Overload at VDDP regulator</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overload</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVERVOLT</name>
							<description>Overvoltage at VDDP regulator</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overvoltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overvoltage</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_FAIL_EN</name>
							<description>Enabling of VDDC status information as interrupt source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No interrupts are generated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupts are generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERLOAD</name>
							<description>Overload at VDDC regulator</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overload</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVERVOLT</name>
							<description>Overvoltage at VDDC regulator</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No overvoltage</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overvoltage</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_FAIL_STS</name>
					<description>System Fail Status Register</description>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WDT1_SEQ_FAIL</name>
							<description>External Watchdog (WDT1) Sequential Fail</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Fail</name>
									<description>System working properly</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Sequential_Watchdog_Fail</name>
									<description>5 consecutive watchdog fails</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT</name>
							<description>System Overtemperature Indication Flag</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overtemperature</name>
									<description>System ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overtemperature</name>
									<description>System Overtemperature</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_5V_OVL</name>
							<description>VDDP Overload Flag</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overload</name>
									<description>VDDP ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<description>VDDP Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_1V5_OVL</name>
							<description>VDDC Overload Flag</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overload</name>
									<description>VDDC ok</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overload</name>
									<description>Hall VDDC Overload</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPP_TMOUT</name>
							<description>Supply Time Out</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Main_Supply_ok</name>
									<description>VDDP or VDDC are in expected range</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Main_Supply_fail</name>
									<description>VDDP or VDDC do not have stable operating point</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SUPP_SHORT</name>
							<description>Supply Short</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Main_Supply_ok</name>
									<description>VDDP or VDDC are in expected range</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Main_Supply_short</name>
									<description>VDDP or VDDC do not have stable operating point</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SystemStartConfig</name>
					<description>System Startup Config</description>
					<addressOffset>0x2D4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MBIST_EN</name>
							<description>System Startup Configuration Bit for RAM MBIST at Sleep Mode exit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No MBIST executed at Sleep Mode exit</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MBIST executed at Sleep Mode exit</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>VDDEXT_CTRL</name>
					<description>VDDEXT Control</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#00001111</resetMask>
					<fields>
						<field>
							<name>STABLE</name>
							<description>VDDEXT Supply works inside its specified range 1</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT Voltage inside of specified range</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT Voltage outside of specified range</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OK</name>
							<description>VDDEXT Supply works inside its specified range 2</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT in low drop mode</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT not in low drop mode</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVERLOAD</name>
							<description>VDDEXT Supply Overload</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT not in overload condition</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT in overload condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OVERVOLT</name>
							<description>VDDEXT Supply Overvoltage</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT not in overvoltage condition</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT in overvoltage condition</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SHORT</name>
							<description>VDDEXT Supply Shorted Output</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT no short circuit</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT short circuit</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FAIL_EN</name>
							<description>Enabling of VDDEXT Supply status information as interrupt source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT fail interrupts are disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT fail Interrupts are enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ENABLE</name>
							<description>VDDEXT Supply Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDEXT Supply disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDEXT supply enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STATUS</name>
					<description>Main wake status register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11000000</resetMask>
					<fields>
						<field>
							<name>CYC_WAKE</name>
							<description>Wake-up caused by Cyclic Wake</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MON_WAKE</name>
							<description>Wake-up via MON</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_WAKE</name>
							<description>Wake-up via LIN- Message</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Wake-up occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Wake-up occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WAKE_STS_MON</name>
					<description>Wake Source MON Input Register</description>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<resetValue>#00000000</resetValue>
					<resetMask>#11111111</resetMask>
					<fields>
						<field>
							<name>WAKE_STS</name>
							<description>Status of MON</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No wake-up detected</name>
									<description>.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>wake-up detected</name>
									<description>.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
