cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>P1_DATA</name>
					<description>Port 1 Data Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0x00</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Port 1 Pin 0 Data Value</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 1 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 1 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>Port 1 Pin 1 Data Value</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 1 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 1 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2</name>
							<description>Port 1 Pin 2 Data Value</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 1 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 1 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Port 1 Pin 3 Data Value</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 1 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 1 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Port 1 Pin 4 Data Value</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 1 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 1 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_DIR</name>
					<description>Port 1 Direction Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Port 1 Pin 0 Direction Control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Direction is set to input (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>Port 1 Pin 1 Direction Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Direction is set to input (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2</name>
							<description>Port 1 Pin 2 Direction Control</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Direction is set to input (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Port 1 Pin 3 Direction Control</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Direction is set to input (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Port 1 Pin 4 Direction Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Direction is set to input (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Direction is set to output</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_OD</name>
					<description>Port 1 Open Drain Control Register</description>
					<addressOffset>0x44</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>P1.0 Open Drain Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal Mode, output is actively driven for 0 and 1 state (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Open Drain Mode, output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>P1.1 Open Drain Mode</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal Mode, output is actively driven for 0 and 1 state (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Open Drain Mode, output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3_P2</name>
							<description>P1.3/P1.2 Open Drain Mode</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal Mode, output is actively driven for 0 and 1 state (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Open Drain Mode, output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>P1.4 Open Drain Mode</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal Mode, output is actively driven for 0 and 1 state (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Open Drain Mode, output is actively driven only for 0 state</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_PUDEN</name>
					<description>Port 1 Pull-Up/Pull-Down Enable Register</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-up or Pull-down device is disabled (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-up or Pull-down device is disabled (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-up or Pull-down device is disabled (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-up or Pull-down device is disabled (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Pull-Up/Pull-Down Enable at Port 1 Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-up or Pull-down device is disabled (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up or Pull-down device is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_PUDSEL</name>
					<description>Port 1 Pull-Up/Pull-Down Select Register</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x1F</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>P0</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 0</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up device is selected (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P1</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up device is selected (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P2</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up device is selected (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 3</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up device is selected (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Pull-Up/Pull-Down Select Port 1 Bit 4</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Pull-down device is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Pull-up device is selected (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_DATA</name>
					<description>Port 2 Data Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0x00</resetMask>
					<fields>
						<field>
							<name>P1</name>
							<description>Port 2 Pin 1 Data Value</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 2 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 2 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Port 2 Pin 3 Data Value</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 2 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 2 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Port 2 Pin 4 Data Value</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 2 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 2 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P5</name>
							<description>Port 2 Pin 5 Data Value</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 2 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 2 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P7</name>
							<description>Port 2 Pin 7 Data Value</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Port 2 pin n data value = 0</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Port 2 pin n data value = 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P2_DIR</name>
					<description>Port 2 Direction Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0xBF</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>P1</name>
							<description>Port 2 Pin 1 Driver Control</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input driver is disabled (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P3</name>
							<description>Port 2 Pin 3 Driver Control</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input driver is disabled (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P4</name>
							<description>Port 2 Pin 4 Driver Control</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input driver is disabled (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P5</name>
							<description>Port 2 Pin 5 Driver Control</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input driver is disabled (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>P7</name>
							<description>Port 2 Pin 7 Driver Control</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input driver is enabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input driver is disabled (default)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
