cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU</name>
			<description>System Control Unit</description>
			<baseAddress>0x50005000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>EXINT0_MON_Int</name>
				<description>Interrupt node12: EINT0, MON</description>
				<value>12</value>
			</interrupt>
			<interrupt>
				<name>EXINT1_Int</name>
				<description>Interrupt node13: EINT1</description>
				<value>13</value>
			</interrupt>
			<registers>
				<register>
					<name>APCLK1</name>
					<description>Analog Peripheral Clock Register 1, RESET_TYPE_4</description>
					<addressOffset>0x058</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>APCLK3SCLR</name>
							<description>Analog Peripherals Clock Status Clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_action</name>
									<description>no change</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<description>clear status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK3STS</name>
							<description>Loss of Clock Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No loss of clock</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Loss of Lock occured</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK1STS</name>
							<description>Analog Peripherals Clock Status</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The MI_CLK clock is in the required range</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The MI_CLK clock exceeds the higher limit</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The MI_CLK clock exceeds the lower limit</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The MI_CLK clock is not inside the specified limit.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK1SCLR</name>
							<description>Analog Peripherals Clock Status Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_action</name>
									<description>no change</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<description>clear status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK1FAC</name>
							<description>Analog Module Clock Factor</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Divide by 3</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Divide by 4</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>APCLK2</name>
					<description>Analog Peripheral Clock Register 2, RESET_TYPE_4</description>
					<addressOffset>0x05C</addressOffset>
					<size>32</size>
					<resetValue>0x08</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>APCLK2SCLR</name>
							<description>Analog Peripherals Clock Status Clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_action</name>
									<description>no change</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>clear</name>
									<description>clear status</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK2STS</name>
							<description>Analog Peripherals Clock Status</description>
							<lsb>5</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The TFILT_CLK clock is in the required range</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The TFILT_CLK clock exceeds the higher limit</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The TFILT_CLK clock exceeds the lower limit</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The TFILT_CLK clock is not inside the specified limit.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK2FAC</name>
							<description>Slow Down Clock Divider for TFILT_CLK Generation</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fsys</description>
									<value>0b00000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fsys/2</description>
									<value>0b00001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fsys/3</description>
									<value>0b00010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fsys/4</description>
									<value>0b00011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fsys/5</description>
									<value>0b00100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fsys/6</description>
									<value>0b00101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>fsys/7</description>
									<value>0b00110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>fsys/8</description>
									<value>0b00111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>fsys/9</description>
									<value>0b01000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>fsys/10</description>
									<value>0b01001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>fsys/11</description>
									<value>0b01010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>fsys/12</description>
									<value>0b01011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>fsys/31</description>
									<value>0b11110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>fsys/32</description>
									<value>0b11111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>APCLK_CTRL1</name>
					<description>Analog Peripheral Clock Control 1 Register, RESET_TYPE_4</description>
					<addressOffset>0x054</addressOffset>
					<size>32</size>
					<resetValue>0x30</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>CPCLK_DIV</name>
							<description>Charge Pump Clock Divider</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>divide by 2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>divide by 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPCLK_SEL</name>
							<description>Charge Pump Clock Selection</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LP_CLK is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fsys is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BGCLK_DIV</name>
							<description>Bandgap Clock Divider</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>divide by 2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>divide by 1</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BGCLK_SEL</name>
							<description>Bandgap Clock Selection</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LP_CLK is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fsys is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKWDT_IE</name>
							<description>Clock Watchdog Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3CLK_SEL</name>
							<description>Timer 3 Clock Selection</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>LP_CLK is selected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>MI_CLK is selected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>APCLK_SET</name>
							<description>Set and Overtake Flag for Clock Settings</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Clock Settings are ignored (previous values are hold)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clock Settings Settings are overtaken</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLL_LOCK</name>
							<description>PLL Lock Indicator</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>locked</name>
									<description>PLL has locked</description>
									<value>0b1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>not_locked</name>
									<description>PLL not locked</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>APCLK_CTRL2</name>
					<description>Analog Peripheral Clock Control 2 Register, RESET_TYPE_4</description>
					<addressOffset>0x06C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>T3CLK_DIV</name>
							<description>Timer 3 Clock Divider</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>divide by 4</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>divide by 8</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SDADCCLK_DIV</name>
							<description>SD-ADC Clock Divider</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>divide by 4</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>divide by 8</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BCON1</name>
					<description>Baud Rate Control Register 1, RESET_TYPE_3</description>
					<addressOffset>0x088</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>R</name>
							<description>Baud Rate Generator Run Control Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate generator disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Baud-rate generator enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRPRE</name>
							<description>Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fDIV = fPCLK</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fDIV = fPCLK/2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fDIV = fPCLK/4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fDIV = fPCLK/8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fDIV = fPCLK/16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fDIV = fPCLK/32</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BCON2</name>
					<description>Baud Rate Control Register 2, RESET_TYPE_3</description>
					<addressOffset>0x098</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>R</name>
							<description>Baud Rate Generator Run Control Bit</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate generator disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Baud-rate generator enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BRPRE</name>
							<description>Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fDIV = fPCLK</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fDIV = fPCLK/2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fDIV = fPCLK/4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fDIV = fPCLK/8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fDIV = fPCLK/16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fDIV = fPCLK/32</description>
									<value>0b101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BGH1</name>
					<description>Baud Rate Timer/Reload Register, High Byte, RESET_TYPE_3</description>
					<addressOffset>0x090</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>BR_VALUE</name>
							<description>Baud Rate Timer/Reload Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2</description>
									<value>0x02</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>BGH2</name>
					<description>Baud Rate Timer/Reload Register, High Byte, RESET_TYPE_3</description>
					<addressOffset>0x0A0</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>BR_VALUE</name>
							<description>Baud Rate Timer/Reload Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Baud-rate timer is bypassed.</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2</description>
									<value>0x02</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>BGL1</name>
					<description>Baud Rate Timer/Reload Register, Low Byte 1, RESET_TYPE_3</description>
					<addressOffset>0x08C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>FD_SEL</name>
							<description>Fractional Divider Selection</description>
							<lsb>0</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BR_VALUE</name>
							<description>Baud Rate Timer/Reload Value</description>
							<lsb>5</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
