cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>IRCON0</name>
					<description>Interrupt Request Register 0, RESET_TYPE_3</description>
					<addressOffset>0x004</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>MONF</name>
							<description>Interrupt Flag for External Interrupt MON on falling edge</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONR</name>
							<description>Interrupt Flag for External Interrupt MON on rising edge</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2F</name>
							<description>Interrupt Flag for External Interrupt 2x on falling edge</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2R</name>
							<description>Interrupt Flag for External Interrupt 2x on rising edge</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1F</name>
							<description>Interrupt Flag for External Interrupt 1x on falling edge</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1R</name>
							<description>Interrupt Flag for External Interrupt 1x on rising edge</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0F</name>
							<description>Interrupt Flag for External Interrupt 0x on falling edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0R</name>
							<description>Interrupt Flag for External Interrupt 0x on rising edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON0CLR</name>
					<description>Interrupt Request 0 Clear Register, RESET_TYPE_3</description>
					<addressOffset>0x02C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>MONFC</name>
							<description>Interrupt Flag for External Interrupt MON on falling edge clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MONRC</name>
							<description>Interrupt Flag for External Interrupt MON on rising edge clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2FC</name>
							<description>Interrupt Flag for External Interrupt 2x on falling edge clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT2RC</name>
							<description>Interrupt Flag for External Interrupt 2x on rising edge clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1FC</name>
							<description>Interrupt Flag for External Interrupt 1x on falling edge clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT1RC</name>
							<description>Interrupt Flag for External Interrupt 1x on rising edge clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0FC</name>
							<description>Interrupt Flag for External Interrupt 0x on falling edge clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on falling edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on falling edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXINT0RC</name>
							<description>Interrupt Flag for External Interrupt 0x on rising edge clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt on rising edge event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt on rising edge event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON1</name>
					<description>Interrupt Request Register 1, RESET_TYPE_3</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RIR</name>
							<description>Receive Interrupt Flag for SSC1</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIR</name>
							<description>Transmit Interrupt Flag for SSC1</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIR</name>
							<description>Error Interrupt Flag for SSC1</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON1CLR</name>
					<description>Interrupt Request 1 Clear Register, RESET_TYPE_3</description>
					<addressOffset>0x178</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RIRC</name>
							<description>Receive Interrupt Flag for SSC1 Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIRC</name>
							<description>Transmit Interrupt Flag for SSC1 Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIRC</name>
							<description>Error Interrupt Flag for SSC1 Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON2</name>
					<description>Interrupt Request Register 2, RESET_TYPE_3</description>
					<addressOffset>0x00C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RIR</name>
							<description>Receive Interrupt Flag for SSC2</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIR</name>
							<description>Transmit Interrupt Flag for SSC2</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIR</name>
							<description>Error Interrupt Flag for SSC2</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON2CLR</name>
					<description>Interrupt Request 2 Clear Register, RESET_TYPE_3</description>
					<addressOffset>0x17C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RIRC</name>
							<description>Receive Interrupt Flag for SSC2 Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TIRC</name>
							<description>Transmit Interrupt Flag for SSC2 Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EIRC</name>
							<description>Error Interrupt Flag for SSC2 Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON3</name>
					<description>Interrupt Request Register 3, RESET_TYPE_3</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>CCU6SR1</name>
							<description>Interrupt Flag 1 for CCU6</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR0</name>
							<description>Interrupt Flag 0 for CCU6</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event has not occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event has occurred.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IRCON3CLR</name>
					<description>Interrupt Request 3 Clear Register, RESET_TYPE_3</description>
					<addressOffset>0x190</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>CCU6SR1C</name>
							<description>Interrupt Flag 1 for CCU6 Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6SR0C</name>
							<description>Interrupt Flag 0 for CCU6 Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt event is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt event is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
