cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>P0_POCON0</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0E8</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM1</name>
							<description>P0.1 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM0</name>
							<description>P0.0 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_POCON1</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0EC</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM3</name>
							<description>P0.3 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM2</name>
							<description>P0.2 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P0_POCON2</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0F0</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM4</name>
							<description>P0.4 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON0</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0F8</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM1</name>
							<description>P1.1 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM0</name>
							<description>P1.0 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON1</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0FC</addressOffset>
					<size>32</size>
					<resetValue>0x44</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM3</name>
							<description>P1.3 Port Driver Mode</description>
							<lsb>4</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PDM2</name>
							<description>P1.2 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not used</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not used</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Not Used</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>P1_POCON2</name>
					<description>Port Output Control Register, RESET_TYPE_3</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x04</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PDM4</name>
							<description>P1.4 Port Driver Mode</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Strong driver and sharp edge mode</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Strong driver and medium edge mode</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Strong driver and soft edge mode</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Weak driver</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Medium driver</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>Medium driver</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>Medium driver</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>Weak driver</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PASSWD</name>
					<description>Password Register, RESET_TYPE_3</description>
					<addressOffset>0x0AC</addressOffset>
					<size>32</size>
					<resetValue>0x07</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PASS</name>
							<description>Password Bits</description>
							<lsb>3</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Enables writing of the bit field MODE.</description>
									<value>0b11000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Opens access to writing of all protected bits.</description>
									<value>0b10011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Closes access to writing of all protected bits.</description>
									<value>0b10101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PROTECT_S</name>
							<description>Bit-Protection Signal Status Bit</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Software is able to write to all protected bits.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Software is unable to write to any protected bits.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Bit-Protection Scheme Control Bit</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Scheme Disabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Scheme Enabled (default)</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
