cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>PLL_CON</name>
					<description>PLL Control Register, RESET_TYPE_4</description>
					<addressOffset>0x044</addressOffset>
					<size>32</size>
					<resetValue>0x64</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>NDIV</name>
							<description>PLL N-Divider</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>N = 8</description>
									<value>0b0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>N = 9</description>
									<value>0b0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>N = 10</description>
									<value>0b0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>N = 12</description>
									<value>0b0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>N = 14</description>
									<value>0b0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>N = 15</description>
									<value>0b0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>N = 16 (default)</description>
									<value>0b0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>N = 18</description>
									<value>0b0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value9</name>
									<description>N = 20</description>
									<value>0b1000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value10</name>
									<description>N = 21</description>
									<value>0b1001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value11</name>
									<description>N = 22</description>
									<value>0b1010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value12</name>
									<description>N = 24</description>
									<value>0b1011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value13</name>
									<description>N = 25</description>
									<value>0b1100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value14</name>
									<description>N = 26</description>
									<value>0b1101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value15</name>
									<description>N = 27</description>
									<value>0b1110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value16</name>
									<description>N = 28</description>
									<value>0b1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOBYP</name>
							<description>PLL VCO Bypass Mode Select</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal (or freerunning) operation (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler Mode; VCO is bypassed (PLL output clock is derived from input clock divided by K1-divider)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCDISC</name>
							<description>Oscillator Disconnect</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Oscillator is connected to the PLL</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Oscillator is disconnected to the PLL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart Lock Detection</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Reset lock flag and restart lock detection.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCK</name>
							<description>PLL Lock Status Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The frequency difference of fREF and fDIV is greater than allowed. The VCO part of the PLL can not lock on a target frequency.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The frequency difference of fREF and fDIV is small enough to enable a stable VCO operation.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCON0</name>
					<description>Power Mode Control Register 0, RESET_TYPE_3</description>
					<addressOffset>0x040</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>SD</name>
							<description>Slow Down Mode Enable. Active High.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Slow Down disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Slow Down enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SL</name>
							<description>Sleep Mode Enable. Active High.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Sleep Mode disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Sleep Mode enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>XTAL_ON</name>
							<description>OSC_HP Operation in Power Down Mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>OSC_HP (XTAL) will be put to Power Down mode by hardware in power save mode.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>OSC_HP (XTAL) continues to operate in Power Down mode, if enabled by SCU_OSC_CON.XPD.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCON1</name>
					<description>Peripheral Management Control Register 1, RESET_TYPE_3</description>
					<addressOffset>0x060</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>GPT12_DIS</name>
							<description>General Purpose Timer 12 Disable Request. Active high.</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>GPT12is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the GPT12.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2_DIS</name>
							<description>T2 Disable Request. Active high.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T2 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the T2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU6_DIS</name>
							<description>CCU6 Disable Request. Active high.</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>CCU6 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the CCU6.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC1_DIS</name>
							<description>SSC1 Disable Request. Active high.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SSC1 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the SSC1.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC1_DIS</name>
							<description>ADC1 Disable Request. Active high.</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ADC1 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the ADC.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PMCON2</name>
					<description>Peripheral Management Control Register 2, RESET_TYPE_3</description>
					<addressOffset>0x064</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>T3_DIS</name>
							<description>T3 Disable Request. Active high.</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T3is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the T3.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T21_DIS</name>
							<description>T21 Disable Request. Active high.</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>T21 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the T21.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SSC2_DIS</name>
							<description>SSC2 Disable Request. Active high.</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>SSC2 is in normal operation. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Request to disable the SSC2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTCON</name>
					<description>Reset Control Register, RESET_TYPE_3</description>
					<addressOffset>0x068</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>LOCKUP_EN</name>
							<description>Lockup Reset Enable Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Lockup is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Lockup is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LOCKUP</name>
							<description>Lockup Flag</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Lockup Status not active.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Lockup Status active.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_STRTUP_STS</name>
					<description>System Startup Status Register</description>
					<addressOffset>0x74</addressOffset>
					<size>32</size>
					<resetValue>0x40</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>PG100TP_CHKS_ERR</name>
							<description>100 TP Page Checksum Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>pass</name>
									<description>no checksum error detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>fail</name>
									<description>100TP checksum error detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MRAMINITSTS</name>
							<description>Map RAM Initialization Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>pass</name>
									<description>Map RAM initialization pass</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>fail</name>
									<description>Map RAM initialization finished with fails</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INIT_FAIL</name>
							<description>Initialization at startup failed</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>pass</name>
									<description>no error during startup detected</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>fail</name>
									<description>at least one error during startup detected</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYSCON0</name>
					<description>System Control Register 0, RESET_TYPE_4</description>
					<addressOffset>0x070</addressOffset>
					<size>32</size>
					<resetValue>0xC0</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>SYSCLKSEL</name>
							<description>System Clock Select</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The PLL clock output signal fPLL is used</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The direct clock input from fOSC is used</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The direct low-precision clock input from fLP_CLK is used.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The direct low-precision clock input from fLP_CLK is used.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NVMCLKFAC</name>
							<description>NVM Access Clock Factor</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Divide by 1</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Divide by 2</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Divide by 3</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Divide by 4</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>TCCR</name>
					<description>Temperature Compensation Control Register, RESET_TYPE_3</description>
					<addressOffset>0x0F4</addressOffset>
					<size>32</size>
					<resetValue>0x03</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>TCC</name>
							<description>Temperature Compensation Control</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>TJ: -40 oC to 0 oC</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>TJ: 0 oC to 40 oC</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>TJ: 40 oC to 80 oC</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>TJ: 80 oC to 150 oC</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
