cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>WDTCON</name>
					<description>Watchdog Timer Control Register, RESET_TYPE_3</description>
					<addressOffset>0x050</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>WINBEN</name>
							<description>Watchdog Window-Boundary Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Watchdog Window-Boundary feature is disabled. (default)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Watchdog Window-Boundary feature is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTPR</name>
							<description>Watchdog Prewarning Mode Flag</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Normal mode (default after reset)</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The Watchdog is operating in Prewarning Mode</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTEN</name>
							<description>WDT Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>WDT is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>WDT is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTRS</name>
							<description>WDT Refresh Start</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_action</name>
									<description>WDT not triggered</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>refresh</name>
									<description>WDT refresh is triggered</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDTIN</name>
							<description>Watchdog Timer Input Frequency Selection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Input frequency is fPCLK/2</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Input frequency is fPCLK/128</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTH</name>
					<description>Watchdog Timer, High Byte, RESET_TYPE_3</description>
					<addressOffset>0x084</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>WDT</name>
							<description>Watchdog Timer Current Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTL</name>
					<description>Watchdog Timer, Low Byte, RESET_TYPE_3</description>
					<addressOffset>0x080</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>WDT</name>
							<description>Watchdog Timer Current Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTREL</name>
					<description>Watchdog Timer Reload Register, RESET_TYPE_3</description>
					<addressOffset>0x078</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>WDTREL</name>
							<description>Watchdog Timer Reload Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTWINB</name>
					<description>Watchdog Window-Boundary Count, RESET_TYPE_3</description>
					<addressOffset>0x07C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>WDTWINB</name>
							<description>Watchdog Window-Boundary Count Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SCUPM</name>
			<description>System Control Unit for Power Modules</description>
			<baseAddress>0x50006000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>AMCLK_CTRL</name>
					<description>Analog Module Clock Control</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLKWDT_PD_N</name>
							<description>Clock Watchdog Powerdown</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Clock Watchdog disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLE</name>
									<description>Clock Watchdog enabaled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>AMCLK_FREQ_STS</name>
					<description>Analog Module Clock Frequency Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>#0000000000000000</resetValue>
					<resetMask>#1100000011000000</resetMask>
					<fields>
						<field>
							<name>AMCLK2_FREQ</name>
							<description>Current frequency of Analog Module Clock 2 (TFILT_CLK)</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>AMCLK1_FREQ</name>
							<description>Current frequency of Analog Module Clock System Clock (MI_CLK)</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>AMCLK_TH_HYS</name>
					<description>Analog Module Clock Limit Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0xD4E194B3</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>AMCLK2_LOW_HYS</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Lower Hysteresis</description>
							<lsb>30</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK2_LOW_TH</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Lower Limit Threshold</description>
							<lsb>24</lsb>
							<msb>29</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK2_UP_HYS</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Upper Hysteresis</description>
							<lsb>22</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK2_UP_TH</name>
							<description>Analog Module Clock 2 (TFILT_CLK) Upper Limit Threshold</description>
							<lsb>16</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_LOW_HYS</name>
							<description>Analog Module Clock 1 (MI_CLK) Lower Hysteresis</description>
							<lsb>14</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_LOW_TH</name>
							<description>Analog Module Clock 1 (MI_CLK) Lower Limit Threshold</description>
							<lsb>8</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_UP_HYS</name>
							<description>Analog Module Clock 1 (MI_CLK) Upper Hysteresis</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AMCLK1_UP_TH</name>
							<description>Analog Module Clock 1 (MI_CLK) Upper Limit Threshold</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BDRV_IRQ_CTRL</name>
					<description>Bridge Driver Interrupt Control</description>
					<addressOffset>0x5C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VSD_UPTH_IE</name>
							<description>VSD Measurement Upper Threshold Interrupt Enable</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VSD_LOWTH_IE</name>
							<description>VSD Measurement Lower Threshold Interrupt Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_UPTH_IE</name>
							<description>VCP Measurement Upper Threshold Interrupt Enable</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH1_IE</name>
							<description>VCP Measurement Lower Threshold 1 Interrupt Enable</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCP_LOWTH2_IE</name>
							<description>VCP Measurement Lower Threshold 2 Interrupt Enable</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_OC_IE</name>
							<description>External High Side 2 FET Over-current Interrupt Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_OC_IE</name>
							<description>External High Side 1 FET Over-current Interrupt Enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_OC_IE</name>
							<description>External Low Side 2 FET Over-current Interrupt Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_OC_IE</name>
							<description>External Low Side 1 FET Over-current Interrupt Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS2_DS_IE</name>
							<description>Bridge Driver High Side 2 Pre-Driver Short Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>HS1_DS_IE</name>
							<description>Bridge Driver High Side 1 Pre-Driver Short Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS2_DS_IE</name>
							<description>Bridge Driver Low Side 2 Pre-Driver Short Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LS1_DS_IE</name>
							<description>Bridge Driver Low Side 1 Pre-Driver Short Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
