cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>SYS_IRQ_CTRL</name>
					<description>System Interrupt Control</description>
					<addressOffset>0x28</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC4_EOC_IE</name>
							<description>ADC4 EOC Interrupt Enable</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_EOC_IE</name>
							<description>ADC3 EOC Interrupt Enable</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC2_ESM_IE</name>
							<description>ADC2 Exceptional Sequence Measurement Interrupt Enable</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_OVL_IE</name>
							<description>VREF5V Overload Interrupt Enable</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_UPTH_IE</name>
							<description>VREF5V ADC1 Reference Overvoltage (ADC2, Channel 4) Interrupt Enable</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_LOWTH_IE</name>
							<description>VREF5V ADC1 Reference Undervoltage (ADC2, Channel 4) Interrupt Enable</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_UPTHWARN_IE</name>
							<description>Reference Voltage Overvoltage Interrupt Enable</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_LOTHWARN_IE</name>
							<description>Reference Voltage Undervoltage Interrupt Enable</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_IE</name>
							<description>System Overtemperature Shutdown Interrupt Enable (leads to shutdown of System)</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_IE</name>
							<description>System Overtemperature Warning Interrupt Enable</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_IE</name>
							<description>PMU Regulator Overtemperature Shutdown Interrupt Enable (leads to shutdown of System)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OTWARN_IE</name>
							<description>PMU Regulator Overtemperature Warning Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_TMOUT_IE</name>
							<description>LIN TXD timeout Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_OT_IE</name>
							<description>LIN Overtemperature Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_OC_IE</name>
							<description>LIN Overcurrent Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_IS</name>
					<description>System Interrupt Status</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC4_EOC_IS</name>
							<description>ADC4 EOC Interrupt Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_EOC_IS</name>
							<description>ADC3 EOC Interrupt Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC2_ESM_IS</name>
							<description>ADC2 Exceptional Sequence Measurement Interrupt Status</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_OVL_IS</name>
							<description>VREF5V Overload Interrupt Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_UPTH_IS</name>
							<description>VREF5V ADC1 Reference Overvoltage (ADC2, Channel 4) Interrupt Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_LOWTH_IS</name>
							<description>VREF5V ADC1 Reference Undervoltage (ADC2, Channel 4) Interrupt Status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_UPTHWARN_IS</name>
							<description>8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5) interrupt status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_LOTHWARN_IS</name>
							<description>8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5) interrupt status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_IS</name>
							<description>System Overtemperature Shutdown (ADC2, Channel 8) interrupt status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_IS</name>
							<description>System Overtemperature Prewarning (ADC2, Channel 8) interrupt status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_IS</name>
							<description>PMU Regulator Overtemperature Shutdown (ADC2, Channel 9) interrupt status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OTWARN_IS</name>
							<description>PMU Regulator Overtemperature Prewarning (ADC2, Channel 9) interrupt status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_TMOUT_IS</name>
							<description>LIN TXD timeout</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>LIN TXD timeout occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_OT_IS</name>
							<description>LIN Overtemperature interrupt status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>LIN Overtemperature occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_OC_IS</name>
							<description>LIN Overcurrent interrupt status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>LIN Overcurrent occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
