cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>SYS_ISCLR</name>
					<description>System Interrupt Status Clear</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ADC4_EOC_ICLR</name>
							<description>ADC4 EOC Interrupt Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC3_EOC_ICLR</name>
							<description>ADC3 EOC Interrupt Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ADC2_ESM_ICLR</name>
							<description>ADC2 Exceptional Sequence Measurement Interrupt Status</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_OVL_ICLR</name>
							<description>VREF5V Overload Interrupt Status</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_UPTH_ICLR</name>
							<description>VREF5V ADC1 Reference Overvoltage (ADC2, Channel 4) Interrupt Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VREF5V_LOWTH_ICLR</name>
							<description>VREF5V ADC1 Reference Undervoltage (ADC2, Channel 4) Interrupt Status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_UPTHWARN_ICLR</name>
							<description>8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5) interrupt status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REFBG_LOTHWARN_ICLR</name>
							<description>8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5) interrupt status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OT_ICLR</name>
							<description>System Overtemperature Shutdown (ADC2, Channel 8) interrupt status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYS_OTWARN_ICLR</name>
							<description>System Overtemperature Prewarning (ADC2, Channel 8) interrupt status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OT_ICLR</name>
							<description>PMU Regulator Overtemperature Shutdown (ADC2, Channel 9) interrupt status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PMU_OTWARN_ICLR</name>
							<description>PMU Regulator Overtemperature Prewarning (ADC2, Channel 9) interrupt status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_TMOUT_ICLR</name>
							<description>LIN TXD timeout</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>LIN Overtemperature occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_OT_ICLR</name>
							<description>LIN Overtemperature interrupt status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>LIN Overtemperature occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LIN_OC_ICLR</name>
							<description>LIN Overcurrent interrupt status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>INACTIVE</name>
									<description>no interrupt status set</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACTIVE</name>
									<description>at least one interrupt status set</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_SUPPLY_IRQ_CLR</name>
					<description>System Supply Interrupt Status Clear</description>
					<addressOffset>0x24</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VDD1V5_OV_SCLR</name>
							<description>VDDC Overvoltage Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_SCLR</name>
							<description>VDDP Overvoltage Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_SCLR</name>
							<description>VS Overvoltage Interrupt Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_OV_SCLR</name>
							<description>VBAT Overvoltage Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_SCLR</name>
							<description>VDDC Undervoltage Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_SCLR</name>
							<description>VDDP Undervoltage Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_SCLR</name>
							<description>VS Undervoltage Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_UV_SCLR</name>
							<description>VBAT Undervoltage Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_OV_ICLR</name>
							<description>VDDC Overvoltage Interrupt Status (ADC2 channel 8)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_ICLR</name>
							<description>VDDP Overvoltage Interrupt Status (ADC2 channel 5)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_ICLR</name>
							<description>VS Overvoltage Interrupt Status (ADC2 channel 1)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_OV_ICLR</name>
							<description>VBAT Overvoltage Interrupt Status (ADC2 channel 0)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_ICLR</name>
							<description>VDDC Undervoltage Interrupt Status (ADC2 channel 8)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_ICLR</name>
							<description>VDDP Undervoltage Interrupt Status (ADC2 channel 5)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_ICLR</name>
							<description>VS Undervoltage Interrupt Status (ADC2 channel 1)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_UV_ICLR</name>
							<description>VBAT Undervoltage Interrupt Status (ADC2 channel 0)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
