cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
				<register>
					<name>SYS_SUPPLY_IRQ_CTRL</name>
					<description>System Supply Interrupt Control</description>
					<addressOffset>0x20</addressOffset>
					<size>32</size>
					<resetValue>0x000000FF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VDD1V5_OV_IE</name>
							<description>VDD1V5 Overvoltage Interrupt Enable</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_IE</name>
							<description>VDD5V Overvoltage Interrupt Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_IE</name>
							<description>VS Overvoltage Interrupt Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_OV_IE</name>
							<description>VBAT Overvoltage Interrupt Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_IE</name>
							<description>VDD1V5 Undervoltage Interrupt Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_IE</name>
							<description>VDD5V Undervoltage Interrupt Enable</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_IE</name>
							<description>VS Undervoltage Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_UV_IE</name>
							<description>VBAT Undervoltage Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Interrupt is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Interrupt is enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>SYS_SUPPLY_IRQ_STS</name>
					<description>System Supply Interrupt Status</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VDD1V5_OV_STS</name>
							<description>VDDC Overvoltage Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_STS</name>
							<description>VDDP Overvoltage Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_STS</name>
							<description>VS Overvoltage Interrupt Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_OV_STS</name>
							<description>VBAT Overvoltage Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_STS</name>
							<description>VDDC Undervoltage Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_STS</name>
							<description>VDDP Undervoltage Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_STS</name>
							<description>VS Undervoltage Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_UV_STS</name>
							<description>VBAT Undervoltage Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_OV_IS</name>
							<description>VDDC Overvoltage Interrupt Status (ADC2 channel 8)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_OV_IS</name>
							<description>VDDP Overvoltage Interrupt Status (ADC2 channel 5)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_OV_IS</name>
							<description>VS Overvoltage Interrupt Status (ADC2 channel 1)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_OV_IS</name>
							<description>VBAT Overvoltage Interrupt Status (ADC2 channel 0)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Overvoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD1V5_UV_IS</name>
							<description>VDDC Undervoltage Interrupt Status (ADC2 channel 8)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDD5V_UV_IS</name>
							<description>VDDP Undervoltage Interrupt Status (ADC2 channel 5)</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VS_UV_IS</name>
							<description>VS Undervoltage Interrupt Status (ADC2 channel 1)</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VBAT_UV_IS</name>
							<description>VBAT Undervoltage Interrupt Status (ADC2 channel 0)</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Undervoltage_Interrupt</name>
									<description>occurred</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>WDT1_TRIG</name>
					<description>WDT1 Watchdog Control</description>
					<addressOffset>0x34</addressOffset>
					<size>32</size>
					<resetValue>0x00000108</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SOWCONF</name>
							<description>Short Open Window Configuration</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Short Open Windows disabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOW1</name>
									<description>one successive Short Open Window allowed</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOW2</name>
									<description>two successive Short Open Windows allowed</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SOW3</name>
									<description>three successive Short Open Windows allowed</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDP_SEL</name>
							<description>Watchdog Period Selection and trigger</description>
							<lsb>0</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>SOW_TRIG</name>
									<description>trigger short open window</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_1</name>
									<description>Watchdog period 16 ms</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_2</name>
									<description>Watchdog period 32 ms</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_3</name>
									<description>Watchdog period 48 ms</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WP_63</name>
									<description>Watchdog period 1008 ms</description>
									<value>0x3F</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
