cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>TIMER2</name>
			<description>TIMER2 Module</description>
			<baseAddress>0x48004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>RC2H</name>
					<description>Timer 2 Reload/Capture Register, High Byte</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RC2</name>
							<description>Reload/Capture Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RC2L</name>
					<description>Timer 2 Reload/Capture Register, Low Byte</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RC2</name>
							<description>Reload/Capture Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T2CON</name>
					<description>Timer 2 Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>CP_RL2</name>
							<description>Capture/Reload Select</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Reload upon overflow or upon negative/positive transition at pin T2EX (when EXEN2 = 1).</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Capture Timer 2 data register contents on the negative/positive transition at pin T2EX, provided EXEN2 = 1.The negative or positive transition at Pin T2EX is selected by bit EDGESEL.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>C_T2</name>
							<description>Timer or Counter Select</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer function selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Count upon negative edge at pin T2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TR2</name>
							<description>Timer 2 Start/Stop Control</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Stop Timer 2.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Start Timer 2.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXEN2</name>
							<description>Timer 2 External Enable Control</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External events are disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>External events are enabled in Capture/Reload Mode.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EXF2</name>
							<description>Timer 2 External Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>TF2</name>
							<description>Timer 2 Overflow/Underflow Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T2CON1</name>
					<description>Timer 2 Control Register 1</description>
					<addressOffset>0x18</addressOffset>
					<size>32</size>
					<resetValue>0x03</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>EXF2EN</name>
							<description>External Interrupt Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External interrupt is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>External interrupt is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TF2EN</name>
							<description>Overflow/Underflow Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Overflow/underflow interrupt is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overflow/underflow interrupt is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2H</name>
					<description>Timer 2, High Byte</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>T2H</name>
							<description>Timer 2 Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T2ICLR</name>
					<description>Timer 2 Interrupt Clear Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>EXF2CLR</name>
							<description>External Interrupt Clear Flag</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External interrupt is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>External interrupt is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TF2CLR</name>
							<description>Overflow/Underflow Interrupt Clear Flag</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Overflow/underflow interrupt is not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Overflow/underflow interrupt is cleared.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T2L</name>
					<description>Timer 2, Low Byte</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>T2L</name>
							<description>Timer 2 Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>T2MOD</name>
					<description>Timer 2 Mode Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>DCEN</name>
							<description>Up/Down Counter Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Up/Down Counter function is disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Up/Down Counter function is enabled and controlled by pin T2EX (Up = 1, Down = 0)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2PRE</name>
							<description>Timer 2 Prescaler Bit</description>
							<lsb>1</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>fT2 = fPCLK</description>
									<value>0b000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>fT2 = fPCLK / 2</description>
									<value>0b001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>fT2 = fPCLK / 4</description>
									<value>0b010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>fT2 = fPCLK / 8</description>
									<value>0b011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>fT2 = fPCLK / 16</description>
									<value>0b100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>fT2 = fPCLK / 32</description>
									<value>0b101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>fT2 = fPCLK / 64</description>
									<value>0b110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>fT2 = fPCLK / 128</description>
									<value>0b111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PREN</name>
							<description>Prescaler Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Prescaler is disabled and the 2 or 12 divider takes effect.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Prescaler is enabled (see T2PRE bit) and the 2 or 12 divider is bypassed.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDGESEL</name>
							<description>Edge Select in Capture Mode/Reload Mode</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The falling edge at Pin T2EX is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The rising edge at Pin T2EX is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2RHEN</name>
							<description>Timer 2 External Start Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Timer 2 External Start is disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Timer 2 External Start is enabled.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T2REGS</name>
							<description>Edge Select for Timer 2 External Start</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The falling edge at Pin T2EX is selected.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The rising edge at Pin T2EX is selected.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
