cmsis-svd/cmsis-svd/data/Infineon/TLE9868.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>TIMER3</name>
			<description>TIMER3 Module</description>
			<baseAddress>0x48006000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x21</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CMP</name>
					<description>Timer 3 Compare Value</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HI</name>
							<description>Timer 3 Compare Value High Byte</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>TIMER3_CMP_HI</name>
									<description>holds the compare value of high byte for Measurement Interface Trigger.</description>
									<value>0b00000000</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>LO</name>
							<description>Timer 3 Compare Value Low Byte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>TIMER3_CMP_LO</name>
									<description>holds the compare value of low byte for Measurement Interface Trigger.</description>
									<value>0b00000000</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>CNT</name>
					<description>Timer 3</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>HI</name>
							<description>Timer 3 High Register or Preload Value</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>TIMER3_HI</name>
									<description>holds the higher 8-bit part of the 13-bit timer value.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER3_HI</name>
									<description>holds the higher 8-bit part of the 16-bit timer value.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER3_HI</name>
									<description>holds the 8-bit reload value.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER3_HI</name>
									<description>holds the 8-bit timer value.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
						<field>
							<name>LO</name>
							<description>Timer 3 Low Register or Preload Value</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<!--<enumeratedValues>
								<enumeratedValue>
									<name>TIMER3_LO</name>
									<description>holds the lower 5-bit part of the 13-bit timer value.</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER3_LO</name>
									<description>holds the lower 8-bit part of the 16-bit timer value.</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER3_LO</name>
									<description>holds the 8-bit timer value.</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER3_LO</name>
									<description>holds the 8-bit timer value.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>-->
						</field>
					</fields>
				</register>
				<register>
					<name>CTRL</name>
					<description>Timer 3 Control Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>T3H_OVF_IE</name>
							<description>Timer 3 Overflow Interrupt Enable (High Byte Timer)</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Interrupt disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Interrupt enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3L_OVF_IE</name>
							<description>Timer 3 Overflow Interrupt Enable (Low Byte Timer)</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Interrupt disabled.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Interrupt enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3L_OVF_STS</name>
							<description>Timer 3 Overflow Flag (Low Byte Timer)</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>clear</name>
									<description>No overflow occurred.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Overflow occured. Set by hardware when Low Byte of Timer 3 overflows. Cleared by software.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TR3L</name>
							<description>Timer 3 Run Control (Low Byte Timer)</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Stop</name>
									<description>Timer is halted</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Run</name>
									<description>Timer runs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3H_OVF_STS</name>
							<description>Timer 3 Overflow Flag (High Byte Timer)</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>clear</name>
									<description>No Overflow occured.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Set</name>
									<description>Overflow occured. Set by hardware when High Byte of Timer 3 overflows. Cleared by software.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TR3H</name>
							<description>Timer 3 Run Control (High Byte Timer)</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Stop</name>
									<description>Timer is halted</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Run</name>
									<description>Timer runs</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNT_RDY</name>
							<description>Timer 3 Count Ready</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Busy</name>
									<description>Timer hasn't finished counting in Mode 1b, 3b</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Ready</name>
									<description>Timer has finished counting in Mode 1b, 3b</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3_RD_REQ_CONF</name>
							<description>Timer 3 Read Mode</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Software</name>
									<description>Timer 3 Read Request can be triggered by software</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Hardware</name>
									<description>Timer 3 Read Request can be triggered by hardware (in mode 3b)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3_RD_REQ</name>
							<description>Timer 3 Value Read Request</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Timer value is not read from Timer 3</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Timer value is read from Timer 3</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3_PD_N</name>
							<description>Timer 3 Power Down</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Power_Down</name>
									<description>Timer 3 is in Power Down</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>no_Power_Down</name>
									<description>Timer 3 is not in Power Down</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ISRCLR</name>
					<description>Timer 3 Interrupt Status Clear Register</description>
					<addressOffset>0x14</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>T3L_OVF_ICLR</name>
							<description>Timer 3 Overflow Flag (Low Byte Timer) Interrupt Clear</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_action</name>
									<description>Overflow not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overflow cleared. Set by software, cleared by hardware.</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3H_OVF_ICLR</name>
							<description>Timer 3 Overflow Flag (High Byte Timer) Interrupt Clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>no_action</name>
									<description>Overflow not cleared.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Clear</name>
									<description>Overflow cleared. Set by software, cleared by hardware</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>MODE_CONF</name>
					<description>Timer 3 Mode Configuration Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>T3_SUBM</name>
							<description>Sub-Mode Select Bits</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Sub_Mode</name>
									<description>no Sub-Mode enabled</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode_1b</name>
									<description>enables 16 bit Timer triggered by an event. This mode has only an effect with Mode 1 (16 Bit Mode)</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode_3b</name>
									<description>enables two 8-Bit Timers for clock measurement. This Mode has only an effect with Mode 3.</description>
									<value>0b10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3M</name>
							<description>Mode Select Bits</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Mode_0</name>
									<description>13-bit timer</description>
									<value>0b00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode_1</name>
									<description>16-bit timer</description>
									<value>0b01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode_2</name>
									<description>8-bit auto-reload timer</description>
									<value>0b10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Mode_3</name>
									<description>Timer 3 is split into two halves. TL3 is an 8bit timer controlled by the standard Timer 3 low byte control bits, and TH3 is the other 8-bit timer controlled by the standard Timer 3 high byte control bits.</description>
									<value>0b11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>T3_TRIGG_CTRL</name>
					<description>T3 Trigger Control</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RETRIG</name>
							<description>Retrigger Condition (in mode 1b) for CCU6-T12 ZM and CCU6 PM</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>DIS</name>
									<description>Retrigger disabled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>EN</name>
									<description>Retrigger enabled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3_RES_CONF</name>
							<description>Timer 3 Trigger Reset Selection for Mode 1b</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>No_Reset_on_PWM_Edge</name>
									<description>Counter is not reset while PWM Module is running.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset_On_Rising_Edge</name>
									<description>Counter is reset on rising edge input</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset_On_Falling_Edge</name>
									<description>Counter is reset on falling edge input.</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Reset_on_both_Edges</name>
									<description>Counter is reset on both edge inputs.</description>
									<value>0x3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>T3_TRIGG_INP_SEL</name>
							<description>Timer 3 Trigger Input Event Selection (only in mode3b)</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>CCU6_CC6_0</name>
									<description>Capture Compare Unit Channel 0 (CC60).</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6_CC61</name>
									<description>Capture Compare Unit Channel 1 (CC61).</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6_CC62</name>
									<description>Capture Compare Unit Channel 2 (CC62).</description>
									<value>0x2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6_T12_ZM</name>
									<description>Capture Compare Unit T12 Zero Match.</description>
									<value>0x3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6_T12_PM</name>
									<description>Capture Compare Unit T12 Period Match.</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6_COUT6_0</name>
									<description>Capture Compare Unit Channel 0 (COUT60).</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6_COUT61</name>
									<description>Capture Compare Unit Channel 1 (COUT61).</description>
									<value>0x6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CCU6_COUT62</name>
									<description>Capture Compare Unit Channel 2 (COUT62).</description>
									<value>0x7</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
